; domain
(define (domain collective-decision)

;; 1. Comment - Underscores are predicates, dashes are actions
;; 2. Another comment -- Should we unset the preconditions of an action once the action executes? This 
;; will force CELia to check for preconds every single time when an action needs to be run - ASK JEFF
;; 3. ASK JEFF -- Is there some ordering to the setup actions? That should reflect in preconds.

  (:requirements 
    :typing
  )

  (:types
    person - object
    participant - person
  )

  (:predicates
    (orchestrated_collective_ranking)
    (determined_participants)
    (elicited_all_individual_preferences)
    (got_recent_people)
    (got_Celio_context)
    (displayed_participants)
    (displayed_alternatives)
    (got_full_context)
    (set_Celio_context)
    (added_participant ?p - participant)
    (removed_participant ?p - participant)

  ) 

  (:action orchestrate_collective_ranking
    :parameters ()
    :precondition (and 
    				(determined_participants)
    				(elicited_all_individual_preferences))
    :effect (and 
    				(orchestrated_collective_ranking)))

  (:action determine_participants
    :parameters ()
    :precondition (and 
    				(got_recent_people)
    				(got_Celio_context)
    				(displayed_participants))
    :effect (and 
    				(determined_participants)))

  (:action elicit_all_individual_preferences
    :parameters ()
    :precondition (and 
    				(got_Celio_context)
    				(displayed_alternatives))
    :effect (and 
    				(elicited_all_individual_preferences)))

;; Add participants, remove participants 

;; got_recent_people, got_Celio_context, displayed_participants, got_full_context, set_Celio_context, displayed_alternatives

  (:action get_recent_people
    :parameters ()
    :precondition (and )
    :effect (and (got_recent_people)))

  (:action get_Celio_context
    :parameters ()
    :precondition (and )
    :effect (and (got_Celio_context)))

  (:action display_participants
    :parameters ()
    :precondition (and )
    :effect (and (displayed_participants)))

  (:action get_full_context
    :parameters ()
    :precondition (and )
    :effect (and (got_full_context)))

  (:action set_Celio_context
    :parameters ()
    :precondition (and )
    :effect (and (set_Celio_context)))

  (:action display_alternatives
    :parameters ()
    :precondition (and )
    :effect (and (displayed_alternatives)))

	
  (:action add_participant
    :parameters (?p - participant)
    :precondition (and 
    				(got_full_context)
    				(set_Celio_context))
    :effect (and 
    				(displayed_participants)
    				(added_participant ?p)))

  (:action remove_participant
    :parameters (?p - participant)
    :precondition (and 
    				(got_full_context)
    				(set_Celio_context))
    :effect (and 
    				(displayed_participants)
    				(removed_participant ?p)))

)

; problem
(define (problem cd-prob1)
	
  (:domain collective-decision)

  (:objects
    jeff - participant
  )

  (:init
    (got_recent_people)  	
  ) 

  (:goal (and 
  			(added_participant jeff)
  			(orchestrated_collective_ranking))

  )

)

; plan
1. (display_alternatives)
   added: (displayed_alternatives)
   goals met: 0 of 2
2. (get_celio_context)
   added: (got_celio_context)
   goals met: 0 of 2
3. (get_full_context)
   added: (got_full_context)
   goals met: 0 of 2
4. (set_celio_context)
   added: (set_celio_context)
   goals met: 0 of 2
5. (add_participant jeff)
   added: (displayed_participants) (added_participant jeff)
   goals met: 1 of 2
6. (determine_participants)
   added: (determined_participants)
   goals met: 1 of 2
7. (elicit_all_individual_preferences)
   added: (elicited_all_individual_preferences)
   goals met: 1 of 2
8. (orchestrate_collective_ranking)
   added: (orchestrated_collective_ranking)
   goals met: 2 of 2
